using System;

namespace CodeQuality_CleanCode
{
    public class InGeneral
    {
        // Code Quality - это группа разных атрибутов и требований, которые предъявляются коду.
        // Требования Code Quality:
        // Легко читается и воспринимается
        // Легко тестируется и рефакторится
        // Не содержит дублирования
        // Хорошо поддерживается
        // Просто расширяется
        // Легко документируется
        // Написан в одном стиле

        // Ключевые правила Clean Code. Они делятся на несколько секций:
        // Переменные
        // Функции
        // Объекты
        // Классы
        // Ассинхронные операторы
        // Тестирование
        // Общие требования
        
    }
}
